app/controllers/mailers_controller.rb

SELECT  `news`.* FROM `news` WHERE `news`.`id` = 1 LIMIT 1
---
  def create
  	@news = News.find params[:id]