app/controllers/module_users_controller.rb

	def create
		@user = User.find params[:id]
		module_name = convert_controller_to_model(params[:controller_name])
		modul = Modul.where(module_name: module_name)
		module_user = ModuleUser.new({ modul_id: modul.first.id, user_id: @user.id }) if @user.present? && modul.present?
		if module_user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `moduls`.* FROM `moduls` WHERE `moduls`.`module_name` = 'BrunchKnock'  ORDER BY `moduls`.`id` ASC LIMIT 1
SELECT `module_users`.* FROM `module_users` WHERE `module_users`.`modul_id` = 1 AND `module_users`.`user_id` = 1
INSERT INTO `module_users` (`modul_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2015-08-05 14:05:44', '2015-08-05 14:05:44')