app/controllers/news_controller.rb

SELECT `news`.* FROM `news`
---
  def index
  	@news = News.all

INSERT INTO `news` (`subject`, `type_name`, `description`, `link`, `event_date`, `priority`, `modul_id`, `created_at`, `updated_at`) VALUES ('7 FANTASTIC FLAGS THAT BREAK EVERY DESIGN RULE', 'Technology', 'Ted Kaye wrote the book, Good Flag, Bad Flag: How to Design a Great Flag, and as I shared in my TED Talk, Why city flags might be the worst-designed thing you’ve never noticed, he came up with five basic principles for designing a great flag (and almost anything else)', 'http://ideas.ted.com/7-fantastic-flags-that-break-every-design-rule/', '2015-08-05 10:57:30', 1, 1, '2015-08-05 16:00:08', '2015-08-05 16:00:08')
---
  def create
  	@news = News.new(news_params)
  	if @news.save

SELECT  `news`.* FROM `news` WHERE `news`.`id` = 1 LIMIT 1
---
  def edit
  	@news = News.find params[:id]

SELECT  `news`.* FROM `news` WHERE `news`.`id` = 1 LIMIT 1
UPDATE `news` SET `description` = 'Valve’s Steam is the biggest platform in the PC gaming market, with Valves themselves being one of the most prominent companies in the gaming industry as a whole. Steam has millions of accounts all over the world, and in some cases people have invested literally thousands of dollars into their own accounts. Which is why a security breach like the one that just occurred a few days ago is something to take very seriously.', `updated_at` = '2015-07-27 06:51:01' WHERE `news`.`id` = 1
---
  def update
  	@news = News.find params[:id]
  	if @news.update!(news_params)

SELECT  `news`.* FROM `news` WHERE `news`.`id` = 3 LIMIT 1
DELETE FROM `news` WHERE `news`.`id` = 3
---
  def destroy
    @news = News.find params[:id]
    @news.delete